src/Documents/Расход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Расход</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаОбязательныхПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрафикПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаОбязательногоПлатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОплатаОбязательныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОплатаОбязательныхПлатежей</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияДенежныхСредств</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/Расход/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	КонтрольПриПроведенииДокументов.ПроверитьОстаткиДенежныхСредств(Дата, Кошелек, Сумма, Отказ); 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	КонтрольПриПроведенииДокументов.ПроверитьЛимитПоКатегории(Дата, СтатьяРасхода, Сумма, Отказ); 
    
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
	
	Движения.ОплатаОбязательныхПлатежей.Записывать = Истина;
	
	Если ЗначениеЗаполнено(ГрафикПлатежей) Тогда
		
		Движение = Движения.ОплатаОбязательныхПлатежей.Добавить();
		
		Движение.Период 			= Дата;
		Движение.ПредметПлатежа 	= ПредметПлатежа;
		
		Движение.Сумма = Сумма; 
		
	КонецЕсли;  
	
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	
	Движение = Движения.ОстаткиДенежныхСредств.Добавить(); 
	
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	
	Движение.Период 		= Дата;
	Движение.Кошелек 		= Кошелек;
	
	Движение.Сумма = Сумма; 
	
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	
	Движение = Движения.ДвиженияДенежныхСредств.Добавить(); 

	Движение.Период 						= Дата;  
	Движение.СтатьяДвиженияДенежныхСредств 	= СтатьяРасхода;
	
	Движение.Сумма = Сумма;

КонецПроцедуры

#КонецОбласти
